{
    "abilities": [
        {
            "name": "Adaptability",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Damaging Moves that are the same type as the user add an additonal STAB to their damage rolls."
        },
        {
            "name": "Aerilate",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Normal Moves are treated as Flying type, and gain 2 additional STAB damage."
        },
        {
            "name": "Aftermath",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is reduced to 0 HP or less, they create a 5-meter Burst. Everything in the Burst loses 1/4th of its maximum HP."
        },
        {
            "name": "Air Lock",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Sustain"
            ],
            "effect": "The weather is set to normal as long as the user wants it to remain that way."
        },
        {
            "name": "Analytic",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "For the next 5 rounds, if the user's turn comes immediately after any of its target's, the user deals 1 additional STAB damage on all damaging Moves, ignoring Type."
        },
        {
            "name": "Anger Point",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user receives a critical hit, their Attack is raised by 6 Combat Stages."
        },
        {
            "name": "Anticipation",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "During an encounter, the user may target a Pokemon. Roll 1d20; on a 16 or better, the target reveals up to 5 Moves that are Super-Effective against the user and all of them must roll +2 during Accuracy Check to hit. On an 11 - 15, the target only reveals 3 Moves, and below 11 the target reveals only 1 Move."
        },
        {
            "name": "Arena Trap",
            "type": "Cast",
            "keyword": [
                "Daily"
            ],
            "effect": "A large wall of sand, 10 meters high, surrounds the encounter. The diameter of the Arena Trap must be at least 10 metres, but cannot be greater than 40 meters. There must be sufficient ground around to manipulate. The walls are constantly shifting, making it impossible to climb, and if a section is destroyed it immediately restores itself. The walls disappear if the user falls unconscious, dies, or is returned to a pokeball."
        },
        {
            "name": "Aroma Veil",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "The Moves Attract, Disable, Encore, Heal Block, Taunt, and Torment have no effect on the user and their adjacent allies."
        },
        {
            "name": "Aura Break",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "If the abilites Dark Aura or FAiry Aura are activated, Dark and Fairy Moves deal 2 less STAB damage instead of additional, while the Auras remain activated."
        },
        {
            "name": "Bad Dreams",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Anything sleeping within 30 meters of the user loses 1/8th of their maximum HP at the beginning of each round."
        },
        {
            "name": "Battery",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "Raise all adjacent ally's Special Attack by 1 Combat Stage."
        },
        {
            "name": "Battle Armour",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Critical Hits"
        },
        {
            "name": "Beast Boost",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "Whenever the user knocks out a pokemon, it raises its highest non-HP stat by 1 Combat Stage."
        },
        {
            "name": "Berserk",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user's HP is lowered below 50% of its maximum HP, the user's Special Attack is raised by 2 Combat Stages."
        },
        {
            "name": "Big Pecks",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "The user cannot have its Defense stat lowered - directly or via Combat Stage reduction."
        },
        {
            "name": "Blaze",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Fire"
        },
        {
            "name": "Bulletproof",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "The following moves have no effect on the Pokemon: Acid Spray, Aura Sphere, Barrage, Beak Blast, Bullet Seed, Egg Bomb, Electro Ball, Energy Ball, Focus Blast, Gyro Ball, Ice Ball, Magnet Bomb, Mist Ball, Mud Bomb, Octazooka, Pollen Puff, Rock Wrecker, Searing Shot, Seed Bomb, Shadow Ball, Sludge Bomb, Weather Ball, and Zap Cannon."
        },
        {
            "name": "Cheek Pouch",
            "type": "Trigger",
            "keyword": [
                "Hourly"
            ],
            "effect": "When the pokemon eats a Berry, they recover 15 HP in addition to the Berry's effects."
        },
        {
            "name": "Chlorophyll",
            "type": "Trigger",
            "keyword": [
                "Hourly"
            ],
            "effect": "While in Sunny Weather, the Speed stat of the Pokemon is doubled."
        },
        {
            "name": "Clear",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The pokemon's Combat Stages may not be lowered by the effect of Abilities or Moves. Status effects may still alter their Combat Stages."
        },
        {
            "name": "Cloud Nine",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "Return the weather of the field to Neutral if the user is a higher level than the pokemon who caused the weather effect."
        },
        {
            "name": "Colour Change",
            "type": "Cast",
            "keyword": [

            ],
            "effect": "Whenever the user is hit by a damage-dealing Move, the user will change type to that of the Move it was hit by."
        },
        {
            "name": "Comatose",
            "type": "Static",
            "keyword": [

            ],
            "effect": "The user is always Asleep, and cannot be given any other status conditions. The user may act as if it was not asleep."
        },
        {
            "name": "Competitive",
            "type": "Static",
            "keyword": [

            ],
            "effect": "Whenever the user has a Combat Stage lowered by an external force, its Special Attack is raised by 2 Combat Stages for each stage the other was lowered."
        },
        {
            "name": "Compound Eyes",
            "type": "Static",
            "keyword": [

            ],
            "effect": "The user's Accuracy Checks take a -3 bonus."
        },
        {
            "name": "Contrary",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Effects that lower or raise the the user's Combat Stages have the opposite effect."
        },
        {
            "name": "Corrosion",
            "type": "Static",
            "keyword": [

            ],
            "effect": "The user may Poison or Badly Poison any Steel or Poison type Targets."
        },
        {
            "name": "Cursed Body",
            "type": "Trigger",
            "keyword": [
                "Hourly"
            ],
            "effect": "When the user is hit by a Melee Move, that Move becomes Disabled after damage is dealt."
        },
        {
            "name": "Cute Charm",
            "type": "Trigger",
            "keyword": [
                "Daily"
            ],
            "effect": "When an opposite gendered foe attacks the user, they become Infatuated after damage is dealt."
        },
        {
            "name": "Damp",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "A pokemon may not use the Moves Explosion or Self-Destruct, nor activate the Ability Aftermath, within 20 meters of the user."
        },
        {
            "name": "Dancer",
            "type": "Trigger",
            "keyword": [
                "Hourly"
            ],
            "effect": "When the user is within 10 meters of any target that uses a Dance Move, the user may immediately after use the same Move, choosing new targets as needed."
        },
        {
            "name": "Dark Art",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Dark"
        },
        {
            "name": "Dark Aura",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "For the remainder of the encounter, Dark type Moves that deal Damage deal an additional 2 STAB damage."
        },
        {
            "name": "Dazzling",
            "type": "Static",
            "keyword": [

            ],
            "effect": "Pokemon within 20 meters of the user cannot use Interrupt Moves."
        },
        {
            "name": "Defeatist",
            "type": "Trigger",
            "keyword": [

            ],
            "effect": "When the user's HP is lowered below 50% of its maximum HP, the user's Attack and Special Attack are set to -3 Combat Stages, and cannot be raised until it is restored to above 50% of its maximum HP."
        },
        {
            "name": "Defiant",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Whenever the user has a Combat Stage lowered by an external force, its Attack is raised by 2 Combat Stages for each stage the other was lowered."
        },
        {
            "name": "Delta Stream",
            "type": "Cast",
            "keyword": [
                "At-Will",
                "Weather"
            ], 
            "effect": "As a Free Action, eliminate all other Weather effects. As long as the user is present, any other Weather Moves or Abilities fail, and whenever a Pokemon takes Super-Effective damage because of its Flying type, it doesn't."
        },
        {
            "name": "Desolate Land",
            "type": "Cast",
            "keyword": [
                "At-Will",
                "Weather"
            ],
            "effect": "The user may, as a Free Action, use the Move Sunny Day."
        },
        {
            "name": "Disguise",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The first time a user is dealt damage by a Move each encounter, the user instead ignores any effects of the Move."
        },
        {
            "name": "Download",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Whenever the user targets a Pokemon with a damage dealing Move, the target must reveal which of its Defenses are lower. The user is treated as if the relevant attacking stat is raised by 1 Combat Stage."
        },
        {
            "name": "Drizzle",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Weather"
            ],
            "effect": "The user may, as a Free Action, use the Move Rain Dance."
        },
        {
            "name": "Drought",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Weather"
            ],
            "effect": "The user may, as a Free Action, use the Move Sunny Day."
        },
        {
            "name": "Dry Skin",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user loses 1/8th of its maximum HP at the beginning of each round while in Sunny Weather, and heals the same amount in Rainy Weather. Fire type Moves deal damage as if the attacker were 1 Combat Stage higher in the relevant stat, and Water type Moves heal the user for the amount of damage they would cause if the user was Resistant to them."
        },
        {
            "name": "Early Bird",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When making Sleep Checks, the counter starts at 11."
        },
        {
            "name": "Effect Spore",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is hit by a melee Move, roll 1d20. On a result of 15-16, the attacker is poisoned; on 17-18, the attacker is paralyzed; on a 19-20, the attacker falls asleep."
        },
        {
            "name": "Electric Surge",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Weather"
            ],
            "effect": "The user may, as a Free Action, use the Move Electric Terrain."
        },
        {
            "name": "Emergency Exit",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is damaged below 50% of their maximum HP, the user immediately begins to flee - gaining +20 to all Speed Skills. If a trainer does not return the user to its Pokeball within 1 round, the user's Loyalty will be lowered by 1."
        },
        {
            "name": "Fae Force",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Fairy"
        },
        {
            "name": "Fairy Aura",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "For the remainder of the encounter, Fairy type Moves that deal damage gain an additonal 2 STAB damage."
        },
        {
            "name": "Filter",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user takes 1.5x damage instead of 2x damage, and 3x instead of 4x, whenever they are hit by a Super-Effective Move."
        },
        {
            "name": "Flame Body",
            "type": "Trigger",
            "keyword": [
                "Daily"
            ],
            "effect": "When a foe hits the user with a Melee move, they become Burned after damage is dealt."
        },
        {
            "name": "Flare Boost",
            "type": "Static",
            "keyword": [
            ],
            "effect": "When Burned, the user's Special Attack is raised by 2 Combat Stages. If the user is cured of its Burn, its Special Attack is lowered by 2 Combat Stages."
        },
        {
            "name": "Flash Fire",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user does not take damage from Fire moves and may not be Frozen. If hit by a Fire move, the user adds +1/2 STAB to the next Fire Type move they use in the current encounter."
        },
        {
            "name": "Flower Gift",
            "type": "Trigger",
            "keyword": [
                "Burst",
                "Hourly"
            ],
            "effect": "In Sunny Weather, Flower Gift creates a 4-meter burst. The user and all of their allies in Sunny Weather have their Attack and Special Defense raised by 2 Combat Stages."
        },
        {
            "name": "Flower Veil",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Confusion, Infatuation, and having their stats lowered. This applies to the user and its Grass type allies."
        },
        {
            "name": "Fluffy",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user takes 1/2 damage from all Moves that deal physical damage. However, if the Move is Fire type, they take x2 damage. This is applied after weakness and resistance."
        },
        {
            "name": "Focus",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Fighting"
        },
        {
            "name": "Forecast",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "The user's type changes depending on the Weather: Fire for Sunny, Ice for Hail, Water for Rainy. It returns to Normal if it is any other conditon. If there are multiple Weather effects on the field, choose one type for the user to be amongst the corresponding options."
        },
        {
            "name": "Forewarn",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "The targeted foe reveals the Move with the highest damage dice roll that it knows, revealing all in case of a tie. Revealed Moves take a +2 to their Accuracy Check."
        },
        {
            "name": "Freezing Point",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Ice"
        },
        {
            "name": "Friend Guard",
            "type": "Cast",
            "keyword": [
                "Daily"
            ],
            "effect": "For the remainder of the encounter, any adjacent allied pokemon who would be hit by any Moves that have more than one damage dice, including STAB or extra effects, the enmy does not include any STAB in their damage rolls."
        },
        {
            "name": "Frisk",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "The adjacent target reveals what item they are holding, if any."
        },
        {
            "name": "Full Metal Body",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Combat Stages may not be lowered by the fefect of Abilities or Moves. Status conditons may still alter them."
        },
        {
            "name": "Fur Coat",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user takes 1/2 damage from Moves that deal physical damage, after applying weakness and resistance."
        },
        {
            "name": "Gale Wing",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "The user may use a Flying type Move as an Interrupt."
        },
        {
            "name": "Galvanize",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Normal type moves are treated as Electric type Moves, and deal an additional 2 STAB damage."
        },
        {
            "name": "Gather",
            "type": "Cast",
            "keyword": [
                "Weekly"
            ],
            "effect": "The user summons 1-2 Unown of a random nature, that are intially not hostile."
        },
        {
            "name": "Gluttony",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When given a consumable item, the Pokemon immediately eats it. Any effects of the item are doubled."
        },
        {
            "name": "Gooey",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is hit by a melee Move, the attacker's Speed is lowered by 1 Combat Stage."
        },
        {
            "name": "Grass Pelt",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "While on terrain covered in grass, the user's Defense is raised by 2 Combat Stages."
        },
        {
            "name": "Grassy Surge",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Weather"
            ],
            "effect": "The user may, as a Free Action, use the Move Grassy Terrain."
        },
        {
            "name": "Guts",
            "type": "Trigger",
            "keyword": [
                "Hourly"
            ],
            "effect": "When Burned, Frozen, Poisoned, Paralyzed, or put to Sleep, the user's Attack is raised by 2 Combat Stages. When the user loses the status, their attack is lowered the same amount."
        },
        {
            "name": "Harvest",
            "type": "Trigger",
            "keyword": [
                "At-Will"
            ],
            "effect": "Whenever the user eats a Berry, flip a coin. On heads, the user produces another Berry of the same variety as a held item available for use on the next turn; on tails, nothing happens. When in Sunny Weather, Harvest always activates successfully."
        },
        {
            "name": "Haunt",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Ghost"
        },
        {
            "name": "Healer",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "One adjacent target suffering from at least one status condition is instantly cured of all status conditions."
        },
        {
            "name": "Heatproof",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user halves the damage they would take from Fire type Moves after applying weakness and resistance."
        },
        {
            "name": "Heavy Metal",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When referring to Weight Classes, treat the user as if it is 2 higher. The user cannot be pushed."
        },
        {
            "name": "Honey Gather",
            "type": "Cast",
            "keyword": [
                "Daily"
            ],
            "effect": "The user finds Honey if they are not holding an item. If this is activated in an encounter against a wild pokemon, the user cannot miss its next three Moves."
        },
        {
            "name": "Huge Power",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's base attack stat is doubled. This may double any bonuses from Nature or Vitamins, but not from Features."
        },
        {
            "name": "Hustle",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Attack is raised by 1 Combat Stage. The user must roll +2 during Accuracy Checks to hit with physical Moves."
        },
        {
            "name": "Hydration",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "While in Rainy Weather, the user is healed of Burn, Freezing, Paralysis, Poison, or Sleep effects."
        },
        {
            "name": "Hyper Cutter",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Attack is raised by 1 Combat Stage, but the user's Accuracy Check requirements for Physical Moves are raised by 2."
        },
        {
            "name": "Ice Body",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "While in Hail, the user gains 1/16th of their maximum HP at the beginning of their turn."
        },
        {
            "name": "Illuminate",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Moves that target the user must roll +2 to hit during Accuracy Check."
        },
        {
            "name": "Illusion",
            "type": "Trigger",
            "keyword": [
                "At-Will"
            ],
            "effect": "Whenevre the user is sent out of its Pokeball, you may choose another Pokemon that you have with you. The user now looks exactly like that Pokemon until it takes damage as a result of a Move. This change is aesthetic and can be dismissed at any time."
        },
        {
            "name": "Immunity",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "The Poisoned Status Condition."
        },
        {
            "name": "Imposter",
            "type": "Cast",
            "keyword": [
                "Daily"
            ],
            "effect": "When the user is sent out, it may use the Move Transform as a Free Action. If the target of Transform has any modified Combat Stages, apply these to the user. One of the target's abilities is randomly assigned to the user until it uses Transform again."
        },
        {
            "name": "Infiltrator",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user ignores Coats, Hazards, and Walls."
        },
        {
            "name": "Innards Out",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is knocked out by a Melee Move, the user deals damage to the attacker equal to the amount of HP the user had before getting knocked out. Do not apply weakness or resistance when dealing this damage."
        },
        {
            "name": "Inner Focus",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Flinching"
        },
        {
            "name": "Insomnia",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Sleep"
        },
        {
            "name": "Intimidate",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "Lower one target's Attack 1 Combat Stage."
        },
        {
            "name": "Iron Barbs",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is hit by a Melee Move, the attacker loses 1/8th of their maximum HP. Do not apply weakness or resistance."
        },
        {
            "name": "Iron Fist",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user deals an additional 2 STAB damage when using Punch Moves, as well as Hammer-Arm, Meteor Mash, and Sky Uppercut."
        },
        {
            "name": "Justified",
            "type": "Trigger",
            "keyword": [
                "At-Will"
            ],
            "effect": "When the user is hit by a Dark type Move, the user may raise its Attack by 1 Combat Stage."
        },
        {
            "name": "Keen Eye",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user cannot have its Accuracy Check negatively effected by anything other than the target's Evasion."
        },
        {
            "name": "Klutz",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user may drop helf items at will as a free action, even if they have status afflictions. The user may also hold an item and ignore any effects the item has."
        },
        {
            "name": "Landslide",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Ground"
        },
        {
            "name": "Last Chance",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Normal"
        },
        {
            "name": "Leaf Guard",
            "type": "Trigger",
            "keyword": [

            ],
            "effect": "While in Sunny Weather, the user is healed of Burn, Freezing, Paralysis, Poison, or Sleep effects."
        },
        {
            "name": "Levitate",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Ground"
        },
        {
            "name": "Light Metal",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When referring to Weight Classes, treat the user as if it is 2 lower. The user's Speed and Jump skills are increased by 3 and 1 respectively."
        },
        {
            "name": "Lightning Rod",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user is immune to damage and effects from Electric type Moves, and each time they are hit by one, their Special Attack is raised by 1 Combat Stage. If a ranged Electric Move is used within 25 meters of the user, the Move is drawn to the user without fail, and cannot miss."
        },
        {
            "name": "Limber",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Paralysis"
        },
        {
            "name": "Liquid Ooze",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is hit by a draining Move, the attacker loses HP instead of gaining it."
        },
        {
            "name": "Liquid Voice",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When using a Move with the Sound keyword, the Move is changed into a Water type."
        },
        {
            "name": "Long Reach",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user makes no contact with targets when using moves. Also, melee ranged moves are treated as Ranged (10) instead."
        },
        {
            "name": "Mach Speed",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Flying"
        },
        {
            "name": "Magician",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user hits an opponent that is holding an item with a ranged move, and is not holding an item, the user takes the target's held item."
        },
        {
            "name": "Magic Bounce",
            "type": "Trigger",
            "keyword": [
                "Hourly"
            ],
            "effect": "When the user is hit by a Melee non-damaging Move, it may reflect the Move back to the attacker. This may be used to change the placement of any Hazards set within 10 meters of the user."
        },
        {
            "name": "Magic Guard",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Whenever the user would take damage that isn't the direct result of a Move's Damage Dice Roll, the user does not take damage."
        },
        {
            "name": "Magma Armour",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Freezing"
        },
        {
            "name": "Magnet Pull",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "The target Steel type Pokemon may not move more than 20 meters awy from the user, or may not move closer than 20 feet, as the user prefers."
        },
        {
            "name": "Marvel Scale",
            "type": "Static",
            "keyword": [

            ],
            "effect": "When Asleep, Burned, Frozen, Paralyzed, or Poisoned, the user's Defense and Special Defense are raised by 2 Combat Stages. They return to their previous values when cured of their status affliction."
        },
        {
            "name": "Mega Launcher",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user deals an additonal 2 STAB damage when using the Moves: Aura Sphere, Dark Pulse, Dragon Pulse, Heal Pulse, Origin Pulse, or Water Pulse."
        },
        {
            "name": "Merciless",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "If the user is attacking a Poisoned target, its Moves are always Critical Hits."
        },
        {
            "name": "Mind Mold",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Psychic"
        },
        {
            "name": "Minus",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When an ally with the Plus Ability is within 10 meters of the user, the ally's Special Attack is raised by 2 Combat Stages. The ally can only be affected like this by one ally at a time."
        },
        {
            "name": "Misty Surge",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Weather"
            ],
            "effect": "The user may, as a Free Action, use the Move Misty Terrain."
        },
        {
            "name": "Mold Breaker",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "The target's Ability is disabled; it cannot be used until the end of the encounter."
        },
        {
            "name": "Moody",
            "type": "Cast",
            "keyword": [
                
            ],
            "effect": "The user is forced to use Moody on the first turn of an encounter, and once again in 1d4+1 rounds after each use. Roll 1d6 twice, the first die raises the chosen statistic by 2 Combat Stages, and the second die lowers it by 1 Combat Stage. On a 1, re-roll that die; a 2 affects Attack; a 3 affects Defense; a 4 affects Special Attack; a 5 affects Special Defense; a 6 affects Speed."
        },
        {
            "name": "Motor Drive",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The pokemon is immune to the damage and effects of Electric type moves. When hit by one, the user raises its Speed by 1 Combat Stage."
        },
        {
            "name": "Mountain Peak",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Rock"
        },
        {
            "name": "Moxie",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "Whenever the user's Moves cause a target to faint, the user may raise its Attack by 1 Combat Stage."
        },
        {
            "name": "Multiscale",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When the user takes damage from a Move at full HP, half the total damage before applying weakness, resistance, and defense."
        },
        {
            "name": "Multitype",
            "type": "Cast",
            "keyword": [
                "At-Will"
            ],
            "effect": "The user changes its Type to any type. Multitype cannot be copied or disabled."
        },
        {
            "name": "Mummy",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Whenever the user is targeted with a Melee Move, the attacker replaces all of its Abilities with Mummy for 1d6+2 rounds."
        },
        {
            "name": "Natural Cure",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "The user is cured of Burn, Frozen, Paralysis, Poison, and Sleep when returning to its Pokeball."
        },
        {
            "name": "No Guard",
            "type": "Cast",
            "keyword": [
                "At-Will"
            ],
            "effect": "For the remainder of the encounter, the user cannot miss with or be missed by any Moves."
        },
        {
            "name": "Normalize",
            "type": "Cast",
            "keyword": [
                "At-Will"
            ],
            "effect": "For the remainder of the encounter, the user treats all Moves as if they were Normal type."
        },
        {
            "name": "Neuroforce",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When the user deals Super-Effective damage, they deal an additional 3d20 damage."
        },
        {
            "name": "Oblivious",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "The Infatuation conditon, and the effects of the Move Taunt."
        },
        {
            "name": "Overcharge",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Electric"
        },
        {
            "name": "Overcoat",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user does not take damage from Weather effects, and is also immune to the Moves: Cotton Spore, Poison Powder, Powder, Rage Powder, Sleep Powder, Spore, and Stun Spore."
        },
        {
            "name": "Overgrow",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Grass"
        },
        {
            "name": "Own Tempo",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Confusion"
        },
        {
            "name": "Parental Bond",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When using a damaging Move that does have the Scatter keyword, the user may immediately use the same Move against hte same target, or spot if using a Burst Move, unless the foes were lowered to 0 HP or less. The second attack does not use the Move's Damage Dice Roll."
        },
        {
            "name": "Pickpocket",
            "type": "Trigger",
            "keyword": [
                "Daily"
            ],
            "effect": "When the user hits an opponent that has a held item with a Melee Move, the user takes that item if it is not holding any."
        },
        {
            "name": "Pickup",
            "type": "Cast",
            "keyword": [
                "Daily",
                "Pickup"
            ],
            "effect": "You may use Pickup at the end of any encounter. Roll 1d20, and consult the Pickup table to figure out what you find."
        },
        {
            "name": "Pixilate",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Normal type Moves are treated as Fairy type, and deal an additonal 2 STAB damage."
        },
        {
            "name": "Plus",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When an ally with the Minus Ability is within 10 meters of the user, the ally's Special Attack is raised by 2 Combat Stages. The ally can only be affected like this by one ally at a time."
        },
        {
            "name": "Poison Heal",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When Poisoned or Badly Poisoned, the user gains 1/8th of its maximum HP instead of losing HP, as well as not having any Combat Stages lowered as a result of being poisoned."
        },
        {
            "name": "Poison Point",
            "type": "Trigger",
            "keyword": [
                "Daily"
            ],
            "effect": "When the user is hit by a Melee Move, the attacker is Poisoned."
        },
        {
            "name": "Poison Touch",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user can Poison targets of Melee physical damaging Moves with an Accuracy Check roll of 15 or more."
        },
        {
            "name": "Power Construct",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is in danger, it becomes its Complete Form, recovering to its maximum HP and increasing its Base Stats."
        },
        {
            "name": "Power of Alchemy",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "Whenever an ally is knocked out, the user may change its Ability from Power of Alchemy to the ally's Ability until the end of the encounter."
        },
        {
            "name": "Prankster",
            "type": "Cast",
            "keyword": [
                "Daily"
            ],
            "effect": "For the remainder of the encounter, any none-damaging Moves the user knows can be used as an Interrupt, unless it sets the target's HP to 0."
        },
        {
            "name": "Pressure",
            "type": "Cast",
            "keyword": [
                "Daily"  
            ],
            "effect": "When this Ability is activated, all enemies have their Moves set to their original frequencies if they'd been increased, in additon, At-Will Moves are set to Every Other Turn."
        },
        {
            "name": "Primordial Sea",
            "type": "Cast",
            "keyword": [
                "At-Will",
                "Weather"
            ],
            "effect": "The user may, as a Free Action, use the Move Rain Dance."
        },
        {
            "name": "Prism Armour",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user takes damage that would be Super-Effective as if it was not Super-Effective."
        },
        {
            "name": "Protean",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "For the remainder of the encounter, whenever the user uses a Move, it immediately changes its Type to match the Move it's using, before dealing damge."
        },
        {
            "name": "Psychic Surge",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Weather"
            ],
            "effect": "The user may, as a Free Action, use the Move Psychic Terrain."
        },
        {
            "name": "Pure Blooded",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Dragon"
        },
        {
            "name": "Pure Power",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's base Attack is doubled. This may double bonuses from Nature or Vitamins, but not bonuses from Features."
        },
        {
            "name": "Queenly Majesty",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Pokemon within 20 meters of the user cannot use Interrupt Moves."
        },
        {
            "name": "Quick Feet",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When Burned, Frozen, Poisoned, or Asleep, the user's Speed is raised by 2 Combat Stages. When Paralyzed, the user's Speed is raised by 4 Combat Stages. The user's Speed is reset once they lose the Status Condition."
        },
        {
            "name": "Rain Dish",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When in Rainy Weather, the user regains 1/16th of their maximum HP at the beginning of their turns."
        },
        {
            "name": "Rattled",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is hit by a Bug, Dark, or Ghost type Move, they may raise their Speed by 1 Combat Stage."
        },
        {
            "name": "Receiver",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "Whenever an ally is knocked out, the user may change its Ability from Receiver to the ally's Ability until the end of the encounter."
        },
        {
            "name": "Reckless",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user deals an additional 2 STAB damage when using Moves that cause recoil damage."
        },
        {
            "name": "Refrigerate",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Normal type Moves are treated as Ice type, and deal an additional STAB damage."
        },
        {
            "name": "Regenerator",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "The user instantly heals 1/4 of its maximum HP."
        },
        {
            "name": "Rivalry",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When battling a same-gendered foe, the user may raise their Attack by 2 Combat Stages - once per Encounter only."
        },
        {
            "name": "RKS System",
            "type": "Cast",
            "keyword": [
                "At-Will"
            ],
            "effect": "The user may change its type from Normal to the Type according to which memory disc it is holding as a Free Action."
        },
        {
            "name": "Rock Head",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Recoil"
        },
        {
            "name": "Rough Skin",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When the user is hit by a Melee Move, the attacker loses 1/8th of their maximum HP, without applying weakness, resistance, or defenses."
        },
        {
            "name": "Run Away",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user cannot be Trapped, and their Speed Combat Stages cannot be lowered below 0. The user's Speed Skills are +2."
        },
        {
            "name": "Sand Force",
            "type": "Trigger",
            "keyword": [
                "Daily"
            ],
            "effect": "While in a Sandstorm, the user may activate Sand Force to become immune to the Sandstorm damage, and deal an additional +1 STAB with Rock, Steel, and Ground type Moves regardless of the user's type."
        },
        {
            "name": "Sand Rush",
            "type": "Trigger",
            "keyword": [
                "Daily"
            ],
            "effect": "While in a Sandstorm, the user may activate SAnd Rush to become immune to the Sandstorm damage, and raise its Speed by 4 Combat Stages. The user's Speed evasion is not raised because of this."
        },
        {
            "name": "Sand Stream",
            "type": "Cast",
            "keyword": [
                "Daily",
                "Weather"
            ],
            "effect": "The user may, as a Free Action, use the Move Sandstorm."
        },
        {
            "name": "Sand Veil",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Sustain"
            ],
            "effect": "Sand Veil may only be activated in a Sandstorm. The user creates a pocket of Clear Weather around itself and any other targets it wants to that is less than 15 meters away within the Sandstorm. Any Move that tries to target a pokemon inside one of these pockets must roll +2 to hit during Accuracy Check. The effect vanishes once the user falls below 0 HP, or is returned to a Pokeball."
        },
        {
            "name": "Sap Sipper",
            "type": "Static",
            "keyword": [

            ],
            "effect": "The user does not take damage from Grass moves. If hit by one, the user may raise its Attack 1 Combat Stage once per turn."
        },
        {
            "name": "Schooling",
            "type": "Static",
            "keyword": [

            ],
            "effect": "The user must be at least level 20 to benefit from this Ability. When near a large body of water, the user changes into its Schooling form. If the user's HP falls to 50% of its maximum, it returns to its single form."
        },
        {
            "name": "Scrappy",
            "type": "Static",
            "keyword": [

            ],
            "effect": "The user can always hit Ghost type Pokemon, without applying weaknesses, resistances, or immunities. If the target would normally be immune, treat the Move as dealing Neutral damage."
        },
        {
            "name": "Serene Grace",
            "type": "Static",
            "keyword": [

            ],
            "effect": "When a Move's effect has omething that activates if you roll high enough during Accuracy Check, all of those requirements are reduced by 3. This does not apply to Critical Hits."
        },
        {
            "name": "Shadow Shield",
            "type": "Trigger",
            "keyword": [

            ],
            "effect": "When the user is at full HP, it reduces damage from the first damaging Move that hits it by 1/2."
        },
        {
            "name": "Shadow Tag",
            "type": "Cast",
            "keyword": [
                "Daily"
            ],
            "effect": "The user Traps adjacent enemies, who can only Shift within 20 meters of the User."
        },
        {
            "name": "Shed Skin",
            "type": "Cast",
            "keyword": [
                "Daily"
            ],
            "effect": "The user is cured of Burns, Freezing, Paralysis, Poison, and Sleep."
        },
        {
            "name": "Sheer Force",
            "type": "Cast",
            "keyword": [
                "Daily"
            ],
            "effect": "Once used, Sheer Force is active until the end of the encounter. Moves that have additional effects that activate during an Accuracy Check ignore the additional effects, and instead deal an additional 2 STAB damage."
        },
        {
            "name": "Shell Armour",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Critical Hits"
        },
        {
            "name": "Shield Dust",
            "type": "Static",
            "keyword": [

            ],
            "effect": "The secondary effects of damage dealing Moves that target the user are disabled."
        },
        {
            "name": "Shields Down",
            "type": "Static",
            "keyword": [

            ],
            "effect": "When the user's HP is reduced to 50% or less, it changes into its Core form."
        },
        {
            "name": "Simple",
            "type": "Static",
            "keyword": [

            ],
            "effect": "When the user's Combat Stages are changed, the amount they change is doubled."
        },
        {
            "name": "Skill Link",
            "type": "Static",
            "keyword": [

            ],
            "effect": "The user's Moves with the keyword Scatter can be used for their maximum amounts of time, even if one of the first attempts miss."
        },
        {
            "name": "Slow Start",
            "type": "Static",
            "keyword": [

            ],
            "effect": "For 3 rounds, the Pokemon's Speed and Attack stats are halved."
        },
        {
            "name": "Slush Rush",
            "type": "Trigger",
            "keyword": [
                "Daily"
            ],
            "effect": "While in Hail, the user may activate Slush Rush until the end of the encounter, becoming immune to the damage from Hail and raising its Speed by 4 Combat Stages. The user's Speed evasion does not increase due to this."
        },
        {
            "name": "Sniper",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Add an additional Damage Dice Roll - including the base damage - when the user gets a Critical Hit."
        },
        {
            "name": "Snow Cloak",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Sustain"
            ],
            "effect": "Snow Cloak may only be activated while in Hail. The user creates a pocket of Clear Weather around itself and any other targets it wants to that is less than 15 meters away within the Hail. Any Move that tries to target a pokemon inside one of these pockets must roll +2 to hit during Accuracy Check. The effect vanishes once the user falls below 0 HP, or is returned to a Pokeball."
        },
        {
            "name": "Snow Warning",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Weather"
            ],
            "effect": "The user may, as a Free Action, use the Move Hail"
        },
        {
            "name": "Solar Power",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "While in Sunny Weather, the user loses 1/8ths of its max hp on its turn, and its Special Attack is raised by 2 Combat Stages."
        },
        {
            "name": "Solid Rock",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Super Effective, and Super-Super Effective, Moves that target the user are one level less effective."
        },
        {
            "name": "Soul-Heart",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "The user raises its Special Attack by 1 COmbat Stage whenever anything within 50 meters of it is knocked out."
        },
        {
            "name": "Soundproof",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "The following moves have no effect on the Pokemon: Boomburst, Bug Buzz, Chatter, Clanging Scales, Confide, Disarming Voice, Echoed Voice, Grass Whistle, Growl, Heal Bell, Hyper Voice, Metal Sound, Noble Roar, Parting Shot, Perish Song, Relic Song, Roar, Roar of Time, Round, Screech, Sing, Snarl, Snore, Sparkling Aria, Supersonic, and Uproar."
        },
        {
            "name": "Speed Boost",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "For the remainder of the encounter, the user's Speed is raised by 1 Combat Stage at the start of its turn."
        },
        {
            "name": "Stakeout",
            "type": "Trigger",
            "keyword": [
                "Daily"
            ],
            "effect": "When using a damaging Move and targetting a pokemon that was just released from a pokeball, the user does double the normal damage after applying weakness and resistance."
        },
        {
            "name": "Static",
            "type": "Trigger",
            "keyword": [
                "Daily"
            ],
            "effect": "When the user is hit by a Melee Move, the attack becomes Paralyzed after damage is dealt."
        },
        {
            "name": "Stall",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user always goes last in combat. If a pokemon goes to the end of the queue, the user is still the last to move."
        },
        {
            "name": "Stamina",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is with a damaging Move, the user's Defense is raised by 1 Combat Stage after the damage is resolved."
        },
        {
            "name": "Stance Change",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When the user uses a damaging move, switch its Defense and Special Defense stats with the Attack and Special Attack stats. When it uses an Intercept Move, return its stats to normal."
        },
        {
            "name": "Steadfast",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user Flinches, it raises its Speed by 1 Combat Stage."
        },
        {
            "name": "Steelworker",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Steel type Moves deal an additonal 2 STAB."
        },
        {
            "name": "Stench",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's damaging Moves cause the target to Flinch on an Accuracy Check roll of 19-20. If a Move already has a chance to cause Flinching, Stench lowers the threshold by 2."
        },
        {
            "name": "Sticky Hold",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's held items cannot be destroyed, dropped, stolen, or switched"
        },
        {
            "name": "Storm Drain",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user is immune to damage and effects from Water type Moves, and each time they are hit by one, their Special Attack is raised by 1 Combat Stage. If a ranged Water Move is used within 25 meters of the user, the Move is drawn to the user without fail, and cannot miss."
        },
        {
            "name": "Strong Jaw",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user deals an additional 1 STAB when using the following Moves: Bite, Bug Bite, Crunch, Fire Fang, Hyper Fang, Ice Fang, Poison Fang, Psychic Fangs, and Thunder Fang."
        },
        {
            "name": "Sturdy",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user is immune to one-hit-knockout Moves. If any attack would lower the user to 0 HP or less from maximum HP, the user's HP is instead lowered to 1."
        },
        {
            "name": "Suction Cups",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "The following moves have no effect on the user: Roar, and Whirlwind. The user is also immune to Push effects."
        },
        {
            "name": "Super Luck",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Moves are Critical Hits on 18-20. If the Move already has an extended Critcal Hit range, Super Luck extends that range by 2."
        },
        {
            "name": "Surge Surfer",
            "type": "Trigger",
            "keyword": [
                "Daily"
            ],
            "effect": "While in Electrified Weather, the user may activate Surge Surfer and increase their Speed by 4 Combat Stages. They do not gain extra Speed evasion because of this increase."
        },
        {
            "name": "Swarm",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Bug"
        },
        {
            "name": "Sweet Veil",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "The user and adjacent allies are immune to Sleep."
        },
        {
            "name": "Swift Swim",
            "type": "Trigger",
            "keyword": [
                "Hourly"
            ],
            "effect": "While in Rainy Weather, the user's Speed is raised by 4 Combat Stages."
        },
        {
            "name": "Symbiosis",
            "type": "Cast",
            "keyword": [
                "At-Will"
            ],
            "effect": "The user gives its Held Item to an adjacent target without a Held Item."
        },
        {
            "name": "Synchronize",
            "type": "Trigger",
            "keyword": [
                "Hourly"
            ],
            "effect": "Whenever an enemy Burns, Freezes, Paralyzes, Poisons, or puts the user to Sleep, the enemy is given the same Status effect they inflicted."
        },
        {
            "name": "Tangled Feet",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "Whenever the user is hit by a Melee Move, the attacker's Speed is lowered by 1 Combat Stage."
        },
        {
            "name": "Tangling Hair",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "While the user is Confused, enemies must roll +3 during Accuracy Check to hit."
        },
        {
            "name": "Technician",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Damaging Moves with a maximum damage of less than 30 add an additional 2d10 to their damage roll. Technician may only be applied once when used with a Move that has the Scatter keyword."
        },
        {
            "name": "Telepathy",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Whenevre the user is a Legal Target of a Move, if the attacker does not want the user to be targetted, it is not."
        },
        {
            "name": "Teravolt",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "The target's Abilities are Disabled until the end of the encounter."
        },
        {
            "name": "Thick Fat",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user is resistant to Fire and Ice type Moves."
        },
        {
            "name": "Tinted Lens",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's resisted and double-resisted Moves are one step more effective."
        },
        {
            "name": "Torrent",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Water"
        },
        {
            "name": "Tough Claws",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user deals an additional 15 damage when using Melee Moves."
        },
        {
            "name": "Toxic Boost",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When Poisoned or Badly Poisoned, the user's Attack is raised by 2 Combat Stages. When cured, it is lowered by 2 Combat Stages."
        },
        {
            "name": "Trace",
            "type": "Cast",
            "keyword": [
                "Hourly",
                "Sustain"
            ],
            "effect": "The user gains the Ability of a target within 10 metres, until it falls below 0 HP or is recalled to a Pokeball."
        },
        {
            "name": "Triage",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Moves that can cure afflictions or heal HP have Interrupt."
        },
        {
            "name": "Truant",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Roll 1d20 when the user tries to Shift and/or use a Move; on 1-8 the user does nothing; on 9-20 the user acts normally."
        },
        {
            "name": "Turboblaze",
            "type": "Cast",
            "keyword": [
                "Hourly"
            ],
            "effect": "The target's Abilities are Disabled until the end of the encounter."
        },
        {
            "name": "Unaware",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "When the user is attacking or being attacked, it ignores all Combat Stages on the relevant target or attacker."
        },
        {
            "name": "Unbreakable",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Steel"
        },
        {
            "name": "Unburden",
            "type": "Trigger",
            "keyword": [

            ],
            "effect": "After consuming a held item, the user's Speed is raised by 2 Combat Stages."
        },
        {
            "name": "Unnerve",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "During battle, as long as the user has line of sight to an enemy, that enemy may not eat or drink anything. This includes Berries, Vitamins, or anything else that must be eaten to take effect."
        },
        {
            "name": "Venom",
            "type": "Trigger",
            "keyword": [
                "Last Chance"
            ],
            "effect": "Poison"
        },
        {
            "name": "Victory Star",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Any allied pokemon in the encounter gain a -2 bonus to their Accuracy Checks."
        },
        {
            "name": "Vital Spirit",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Sleep"
        },
        {
            "name": "Volt Absorb",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "After calculating damage that would be dealt from an Electric type Move that hit the user, heal half of that value instead of taking damage. Do this before applying defenses, but after weakness and resistance."
        },
        {
            "name": "Water Absorb",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "After calculating damage that would be dealt from a Water type Move that hit the user, heal half of that value instead of taking damage. Do this before applying defenses, but after weakness and resistance."
        },
        {
            "name": "Water Bubble",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "The user is immune to Burn, and is treated as if they were resistant to Fire type Moves."
        },
        {
            "name": "Water Compaction",
            "type": "Trigger",
            "keyword": [
                "Hourly"
            ],
            "effect": "When the user is hit by a Water type damaging Move, raise their Defense by 3 Combat Stages."
        },
        {
            "name": "Water Veil",
            "type": "Static",
            "keyword": [
                "Immune"
            ],
            "effect": "Burns"
        },
        {
            "name": "Weak Armour",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "Whenever the user is hit by a physical attack, the user may lower its Defense by 1 Combat Stage to raise its Speed the same amount."
        },
        {
            "name": "White Smoke",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "The user's Combat Stages may not be lowered."
        },
        {
            "name": "Wimp Out",
            "type": "Trigger",
            "keyword": [
                
            ],
            "effect": "When the user is damaged below 50% of their maximum HP, the user immediately begins to flee - gaining +20 to all Speed Skills. If a trainer does not return the user to its Pokeball within 1 round, the user's Loyalty will be lowered by 1."
        },
        {
            "name": "Wonder Guard",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Only damaging Moves that are Super-Effective hit the user, all other Moves deal 0 damage."
        },
        {
            "name": "Wonder Skin",
            "type": "Static",
            "keyword": [
                
            ],
            "effect": "Whenever the user is hit by a Ranged non-damaging move that inflicts a status conditon, flip a coin; on a heads, the user ignores the affliction it would have received."
        },
        {
            "name": "Zen Mode",
            "type": "Cast",
            "keyword": [
                "At-Will"
            ],
            "effect": "Keep two sets of Base Stats for the user, with the HP stats kept the same. If the user has its base stats altered in any way, both sets are affected. As a Free Action, the user may activate Zen Mode if it has less than 50% of its maximum HP, and may switch back as a Free Action. The user may switch forms once per encounter."
        }
    ]
}
